//******************************************************************************
#include "networkinterfaces.h"
//******************************************************************************
NetworkInterfaces::NetworkInterfaces()
{
    interface = new QNetworkInterface();
//    parent = new QObject();
//    cmd = new QProcess(parent);
}
//----------------------------------------------------------------------------------
//***--------Функция получения  информации о интерфейсе--------***
//----------------------------------------------------------------------------------
QString NetworkInterfaces::InfoInterfaces()
{
    qDebug() << "mmm" << interface->allAddresses();
    return 0;
}
//----------------------------------------------------------------------------------
//***--------Функция построения доплеровского смещения несущей частоты--------***
//----------------------------------------------------------------------------------
void NetworkInterfaces::SetAddress(QString nameInterfaces, QString Address, QString Mask, QString GateWay)
{

}
